import { MenuData } from "@/types/menu";

export const menuData: MenuData = {
  "ركن السندوتشات": [
    { name: "كبدة إسكندراني", price: 25 },
    { name: "سجق إسكندراني", price: 25 },
    { name: "حواوشي لحمة", price: 40 },
    { name: "حواوشي جبنة", price: 50 }
  ],
  "ركن المكرونة": [
    { name: "مكرونة بالكبدة", price: 50 },
    { name: "مكرونة بالسجق", price: 50 }
  ],
  "الساقع": [
    { name: "مياه", price: 10 },
    { name: "ساقع", price: 25 }
  ]
};

export const categoryIcons: { [key: string]: string } = {
  "ركن السندوتشات": "🥪",
  "ركن المكرونة": "🍝",
  "الساقع": "🧊"
};
